Switch>
Switch>enable
Switch#conf t
Switch#conf terminal 
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#vlan 10
Switch(config-vlan)#vlan 20
Switch(config-vlan)#vlan 30
Switch(config-vlan)#vlan 40


Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa0/4
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20 
Switch(config-if)#int fa0/5
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20 
Switch(config-if)#int fa0/6
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 20 
Switch(config-if)#int fa0/7
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 30 
Switch(config-if)#int fa0/8
Switch(config-if)#switchport access vlan 30 
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 30 
Switch(config-if)#int fa0/9
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 30 
Switch(config-if)#int fa0/10
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 40 
Switch(config-if)#int fa0/11
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 40 
Switch(config-if)#int fa0/12
Switch(config-if)#switchport mode access
Switch(config-if)#switchport access vlan 40 
Switch(config-if)#
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#show vlan


Switch#
Switch#conf t
Enter configuration commands, one per line.  End with CNTL/Z.
Switch(config)#int fa0/13
Switch(config-if)#switchport mode trunk

Switch(config-if)#
%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/13, changed state to down

%LINEPROTO-5-UPDOWN: Line protocol on Interface FastEthernet0/13, changed state to up

Switch(config-if)#end
Switch#
%SYS-5-CONFIG_I: Configured from console by console

Switch#copy run start
Destination filename [startup-config]? 
Building configuration...
[OK]
Switch#
                    